tap "homebrew/bundle"

# CLI essentials
brew "git"      # Version control
brew "wget"     # File downloads
brew "curl"     # HTTP client
brew "jq"       # JSON processor
brew "ripgrep"  # Fast search
brew "fd"       # Fast find
brew "fzf"      # Fuzzy finder
brew "tree"     # Directory view
brew "htop"     # Process monitor
brew "mas"      # App Store CLI

# Language/runtime managers
brew "nvm"      # Node manager
brew "pyenv"    # Python manager
brew "pipx"     # Python CLI apps

# Container runtime
brew "docker"          # Docker CLI
brew "docker-compose"  # Compose CLI
brew "colima"          # Headless containers

# Applications
cask "visual-studio-code"  # Code editor
cask "google-chrome"       # Browser
cask "microsoft-edge"      # Browser
cask "telegram"            # Messaging
cask "iterm2"              # Terminal
cask "rectangle"           # Window manager

# AI desktop tools
cask "claude"  # AI assistant

# Optional desktop container runtime.
# Use only when you want Docker's GUI instead of Colima.
# cask "docker"  # Docker Desktop

# Optional AI desktop tools.
# Uncomment only if these casks are available in your Homebrew setup.
# cask "codex"  # Codex app

# Optional monitoring/log forwarding stack.
# Enable after choosing a Google Cloud project and service account.
# brew "osquery"           # Host inventory
# brew "fluent-bit"        # Log forwarding
# brew "google-cloud-sdk"  # Google Cloud CLI

# Optional Mac App Store apps.
# Uncomment after checking the app IDs are what you want.
# mas "Xcode", id: 497799835  # Apple IDE
# mas "Slack", id: 803453959  # Team chat
